64g3_2419X91296JF.txt
Seq1M-Read-Q8: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=8
Seq1M-Write-Q8: (g=1): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=8
Seq1M-Read: (g=2): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
Seq1M-Write: (g=3): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
Rand-Read-4K-Q32: (g=4): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
Rand-Write-4K-Q32: (g=5): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
Rand-Read-4K: (g=6): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
Rand-Write-4K: (g=7): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
fio-3.28
Starting 8 processes
3;fio-3.28;Seq1M-Read-Q8;0;0;1048576;88869;86;11799;320;23524;11474.218959;1328.912764;23153;94399;80478.507799;3109.029302;1.000000%=70778;5.000000%=80216;10.000000%=80216;20.000000%=80216;30.000000%=80216;40.000000%=80216;50.000000%=80216;60.000000%=80216;70.000000%=81264;80.000000%=81264;90.000000%=82313;95.000000%=83361;99.000000%=85458;99.500000%=90701;99.900000%=92798;99.950000%=94896;99.990000%=94896;0%=0;0%=0;0%=0;34529;106119;91955.645471;3223.296235;79379;90292;99.727591%;88626.913043;2423.370510;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.186472%;1.457874%;1024;0;2058;0.1%;0.2%;0.4%;99.3%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.29%;99.71%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;359415;67382;3;0;210099;167643;377743;99.56%
3;fio-3.28;Seq1M-Write-Q8;1;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;1048576;38810;37;27018;28;65787;26322.287160;3665.688789;28416;242439;184079.840548;20739.098190;1.000000%=158334;5.000000%=160432;10.000000%=160432;20.000000%=162529;30.000000%=166723;40.000000%=170917;50.000000%=183500;60.000000%=198180;70.000000%=200278;80.000000%=202375;90.000000%=208666;95.000000%=210763;99.000000%=223346;99.500000%=225443;99.900000%=235929;99.950000%=242221;99.990000%=242221;0%=0;0%=0;0%=0;58406;273075;210406.277763;23159.599193;23695;45146;99.791826%;38729.207547;4601.702421;0.499685%;0.814302%;1040;0;10;0.1%;0.2%;0.4%;99.3%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.10%;0.20%;99.71%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;359415;67382;3;0;210099;167643;377743;99.56%
3;fio-3.28;Seq1M-Read;2;0;1048576;83372;81;12577;132;658;195.224084;26.275815;11815;13585;12066.741675;116.897572;1.000000%=11862;5.000000%=11993;10.000000%=11993;20.000000%=11993;30.000000%=11993;40.000000%=11993;50.000000%=12124;60.000000%=12124;70.000000%=12124;80.000000%=12124;90.000000%=12124;95.000000%=12124;99.000000%=12255;99.500000%=13172;99.900000%=13434;99.950000%=13565;99.990000%=13565;0%=0;0%=0;0%=0;12003;13862;12263.658607;127.652395;81636;84136;100.000000%;83498.000000;989.105173;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.437341%;1.860687%;1032;0;267;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;100.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;359415;67382;3;0;210099;167643;377743;99.56%
3;fio-3.28;Seq1M-Write;3;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;1048576;35037;34;29927;164;374;271.332378;33.892653;24634;56098;28933.265660;2301.967575;1.000000%=25559;5.000000%=26083;10.000000%=26345;20.000000%=27131;30.000000%=27656;40.000000%=28180;50.000000%=28704;60.000000%=29491;70.000000%=29753;80.000000%=30277;90.000000%=31064;95.000000%=31850;99.000000%=36962;99.500000%=39059;99.900000%=52690;99.950000%=55836;99.990000%=55836;0%=0;0%=0;0%=0;24911;56403;29206.303676;2301.165572;30720;36937;100.000000%;35074.220339;1498.535286;0.661632%;0.554702%;1041;0;12;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;99.80%;0.20%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;359415;67382;3;0;210099;167643;377743;99.56%
3;fio-3.28;Rand-Read-4K-Q32;4;0;727268;12120;3030;60001;7;1399;325.206727;34.111092;662;12012;10231.345232;265.423874;1.000000%=9633;5.000000%=9895;10.000000%=9895;20.000000%=10027;30.000000%=10027;40.000000%=10158;50.000000%=10158;60.000000%=10289;70.000000%=10289;80.000000%=10420;90.000000%=10551;95.000000%=10682;99.000000%=10813;99.500000%=10944;99.900000%=11337;99.950000%=11468;99.990000%=11599;0%=0;0%=0;0%=0;1002;12373;10557.223484;271.350156;11712;12392;100.000000%;12130.655462;187.501206;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;1.545000%;5.513333%;181862;0;41;0.1%;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.00%;0.01%;0.01%;17.54%;82.45%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;359415;67382;3;0;210099;167643;377743;99.56%
3;fio-3.28;Rand-Write-4K-Q32;5;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;132176;2202;550;60003;52;14710;1794.283043;611.126703;1737;99297;56239.900297;4283.865523;1.000000%=50069;5.000000%=54263;10.000000%=54263;20.000000%=54788;30.000000%=54788;40.000000%=54788;50.000000%=54788;60.000000%=54788;70.000000%=55312;80.000000%=55312;90.000000%=61079;95.000000%=68681;99.000000%=69730;99.500000%=72876;99.900000%=80216;99.950000%=84410;99.990000%=84410;0%=0;0%=0;0%=0;3515;101258;58036.415676;4370.000499;1728;2476;100.000000%;2204.420168;94.487242;1.656611%;4.261525%;33099;0;11;0.1%;0.1%;0.1%;0.1%;0.1%;99.9%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.01%;0.01%;0.02%;1.56%;98.41%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;359415;67382;3;0;210099;167643;377743;99.56%
3;fio-3.28;Rand-Read-4K;6;0;701048;11683;2920;60001;5;1715;14.663563;5.526216;241;2031;324.761068;35.381217;1.000000%=254;5.000000%=259;10.000000%=268;20.000000%=284;30.000000%=325;40.000000%=329;50.000000%=333;60.000000%=342;70.000000%=346;80.000000%=350;90.000000%=358;95.000000%=358;99.000000%=370;99.500000%=378;99.900000%=456;99.950000%=505;99.990000%=1036;0%=0;0%=0;0%=0;251;2049;339.823911;36.317375;11184;11848;100.000000%;11698.865546;138.482326;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;1.770000%;6.285000%;175302;0;10;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.04%;99.91%;0.02%;0.01%;0.01%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;359415;67382;3;0;210099;167643;377743;99.56%
3;fio-3.28;Rand-Write-4K;7;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;129568;2159;539;60002;8;341;55.002957;11.575397;1345;27205;1784.913745;628.227721;1.000000%=1466;5.000000%=1548;10.000000%=1630;20.000000%=1695;30.000000%=1712;40.000000%=1744;50.000000%=1744;60.000000%=1761;70.000000%=1777;80.000000%=1794;90.000000%=1925;95.000000%=1957;99.000000%=2039;99.500000%=2244;99.900000%=13828;99.950000%=14221;99.990000%=15532;0%=0;0%=0;0%=0;1357;27217;1840.889178;629.265679;1883;2648;100.000000%;2162.462185;122.719799;1.511641%;4.231596%;32409;0;10;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;98.35%;1.40%;0.00%;0.24%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;sdb;359415;67382;3;0;210099;167643;377743;99.56%

Seq1M-Read-Q8: (groupid=0, jobs=1): err= 0: pid=8661: Wed Jul 31 19:17:00 2024
  read: IOPS=86, BW=86.8MiB/s (91.0MB/s)(1024MiB/11799msec)
    slat (usec): min=320, max=23524, avg=11474.22, stdev=1328.91
    clat (usec): min=23153, max=94399, avg=80478.51, stdev=3109.03
     lat (msec): min=34, max=106, avg=91.96, stdev= 3.22
    clat percentiles (usec):
     |  1.00th=[70779],  5.00th=[80217], 10.00th=[80217], 20.00th=[80217],
     | 30.00th=[80217], 40.00th=[80217], 50.00th=[80217], 60.00th=[80217],
     | 70.00th=[81265], 80.00th=[81265], 90.00th=[82314], 95.00th=[83362],
     | 99.00th=[85459], 99.50th=[90702], 99.90th=[92799], 99.95th=[94897],
     | 99.99th=[94897]
   bw (  KiB/s): min=79379, max=90292, per=99.73%, avg=88626.91, stdev=2423.37, samples=23
   iops        : min=   77, max=   88, avg=86.39, stdev= 2.43, samples=23
  lat (msec)   : 50=0.29%, 100=99.71%
  cpu          : usr=0.19%, sys=1.46%, ctx=1024, majf=0, minf=2058
  IO depths    : 1=0.1%, 2=0.2%, 4=0.4%, 8=99.3%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1024,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
Seq1M-Write-Q8: (groupid=1, jobs=1): err= 0: pid=8666: Wed Jul 31 19:17:00 2024
  write: IOPS=37, BW=37.9MiB/s (39.7MB/s)(1024MiB/27018msec); 0 zone resets
    slat (usec): min=28, max=65787, avg=26322.29, stdev=3665.69
    clat (msec): min=28, max=242, avg=184.08, stdev=20.74
     lat (msec): min=58, max=273, avg=210.41, stdev=23.16
    clat percentiles (msec):
     |  1.00th=[  159],  5.00th=[  161], 10.00th=[  161], 20.00th=[  163],
     | 30.00th=[  167], 40.00th=[  171], 50.00th=[  184], 60.00th=[  199],
     | 70.00th=[  201], 80.00th=[  203], 90.00th=[  209], 95.00th=[  211],
     | 99.00th=[  224], 99.50th=[  226], 99.90th=[  236], 99.95th=[  243],
     | 99.99th=[  243]
   bw (  KiB/s): min=23695, max=45146, per=99.79%, avg=38729.21, stdev=4601.70, samples=53
   iops        : min=   23, max=   44, avg=37.75, stdev= 4.49, samples=53
  lat (msec)   : 50=0.10%, 100=0.20%, 250=99.71%
  cpu          : usr=0.50%, sys=0.81%, ctx=1040, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.2%, 4=0.4%, 8=99.3%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1024,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
Seq1M-Read: (groupid=2, jobs=1): err= 0: pid=8670: Wed Jul 31 19:17:00 2024
  read: IOPS=81, BW=81.4MiB/s (85.4MB/s)(1024MiB/12577msec)
    slat (usec): min=132, max=658, avg=195.22, stdev=26.28
    clat (usec): min=11815, max=13585, avg=12066.74, stdev=116.90
     lat (usec): min=12003, max=13862, avg=12263.66, stdev=127.65
    clat percentiles (usec):
     |  1.00th=[11863],  5.00th=[11994], 10.00th=[11994], 20.00th=[11994],
     | 30.00th=[11994], 40.00th=[11994], 50.00th=[12125], 60.00th=[12125],
     | 70.00th=[12125], 80.00th=[12125], 90.00th=[12125], 95.00th=[12125],
     | 99.00th=[12256], 99.50th=[13173], 99.90th=[13435], 99.95th=[13566],
     | 99.99th=[13566]
   bw (  KiB/s): min=81636, max=84136, per=100.00%, avg=83498.00, stdev=989.11, samples=24
   iops        : min=   79, max=   82, avg=81.38, stdev= 1.01, samples=24
  lat (msec)   : 20=100.00%
  cpu          : usr=0.44%, sys=1.86%, ctx=1032, majf=0, minf=267
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1024,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
Seq1M-Write: (groupid=3, jobs=1): err= 0: pid=8671: Wed Jul 31 19:17:00 2024
  write: IOPS=34, BW=34.2MiB/s (35.9MB/s)(1024MiB/29927msec); 0 zone resets
    slat (usec): min=164, max=374, avg=271.33, stdev=33.89
    clat (usec): min=24634, max=56098, avg=28933.27, stdev=2301.97
     lat (usec): min=24911, max=56403, avg=29206.30, stdev=2301.17
    clat percentiles (usec):
     |  1.00th=[25560],  5.00th=[26084], 10.00th=[26346], 20.00th=[27132],
     | 30.00th=[27657], 40.00th=[28181], 50.00th=[28705], 60.00th=[29492],
     | 70.00th=[29754], 80.00th=[30278], 90.00th=[31065], 95.00th=[31851],
     | 99.00th=[36963], 99.50th=[39060], 99.90th=[52691], 99.95th=[55837],
     | 99.99th=[55837]
   bw (  KiB/s): min=30720, max=36937, per=100.00%, avg=35074.22, stdev=1498.54, samples=59
   iops        : min=   30, max=   36, avg=34.19, stdev= 1.46, samples=59
  lat (msec)   : 50=99.80%, 100=0.20%
  cpu          : usr=0.66%, sys=0.55%, ctx=1041, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1024,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
Rand-Read-4K-Q32: (groupid=4, jobs=1): err= 0: pid=8675: Wed Jul 31 19:17:00 2024
  read: IOPS=3030, BW=11.8MiB/s (12.4MB/s)(710MiB/60001msec)
    slat (usec): min=7, max=1399, avg=325.21, stdev=34.11
    clat (usec): min=662, max=12012, avg=10231.35, stdev=265.42
     lat (usec): min=1002, max=12373, avg=10557.22, stdev=271.35
    clat percentiles (usec):
     |  1.00th=[ 9634],  5.00th=[ 9896], 10.00th=[ 9896], 20.00th=[10028],
     | 30.00th=[10028], 40.00th=[10159], 50.00th=[10159], 60.00th=[10290],
     | 70.00th=[10290], 80.00th=[10421], 90.00th=[10552], 95.00th=[10683],
     | 99.00th=[10814], 99.50th=[10945], 99.90th=[11338], 99.95th=[11469],
     | 99.99th=[11600]
   bw (  KiB/s): min=11712, max=12392, per=100.00%, avg=12130.66, stdev=187.50, samples=119
   iops        : min= 2928, max= 3098, avg=3032.57, stdev=47.00, samples=119
  lat (usec)   : 750=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=17.54%, 20=82.45%
  cpu          : usr=1.54%, sys=5.51%, ctx=181862, majf=0, minf=41
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=181817,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
Rand-Write-4K-Q32: (groupid=5, jobs=1): err= 0: pid=8676: Wed Jul 31 19:17:00 2024
  write: IOPS=550, BW=2203KiB/s (2256kB/s)(129MiB/60003msec); 0 zone resets
    slat (usec): min=52, max=14710, avg=1794.28, stdev=611.13
    clat (usec): min=1737, max=99297, avg=56239.90, stdev=4283.87
     lat (msec): min=3, max=101, avg=58.04, stdev= 4.37
    clat percentiles (usec):
     |  1.00th=[50070],  5.00th=[54264], 10.00th=[54264], 20.00th=[54789],
     | 30.00th=[54789], 40.00th=[54789], 50.00th=[54789], 60.00th=[54789],
     | 70.00th=[55313], 80.00th=[55313], 90.00th=[61080], 95.00th=[68682],
     | 99.00th=[69731], 99.50th=[72877], 99.90th=[80217], 99.95th=[84411],
     | 99.99th=[84411]
   bw (  KiB/s): min= 1728, max= 2476, per=100.00%, avg=2204.42, stdev=94.49, samples=119
   iops        : min=  432, max=  619, avg=551.09, stdev=23.65, samples=119
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.02%, 50=1.56%
  lat (msec)   : 100=98.41%
  cpu          : usr=1.66%, sys=4.26%, ctx=33099, majf=0, minf=11
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=99.9%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,33044,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
Rand-Read-4K: (groupid=6, jobs=1): err= 0: pid=8680: Wed Jul 31 19:17:00 2024
  read: IOPS=2920, BW=11.4MiB/s (12.0MB/s)(685MiB/60001msec)
    slat (usec): min=5, max=1715, avg=14.66, stdev= 5.53
    clat (usec): min=241, max=2031, avg=324.76, stdev=35.38
     lat (usec): min=251, max=2049, avg=339.82, stdev=36.32
    clat percentiles (usec):
     |  1.00th=[  255],  5.00th=[  260], 10.00th=[  269], 20.00th=[  285],
     | 30.00th=[  326], 40.00th=[  330], 50.00th=[  334], 60.00th=[  343],
     | 70.00th=[  347], 80.00th=[  351], 90.00th=[  359], 95.00th=[  359],
     | 99.00th=[  371], 99.50th=[  379], 99.90th=[  457], 99.95th=[  506],
     | 99.99th=[ 1037]
   bw (  KiB/s): min=11184, max=11848, per=100.00%, avg=11698.87, stdev=138.48, samples=119
   iops        : min= 2796, max= 2962, avg=2924.37, stdev=34.56, samples=119
  lat (usec)   : 250=0.04%, 500=99.91%, 750=0.02%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=1.77%, sys=6.29%, ctx=175302, majf=0, minf=10
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=175262,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
Rand-Write-4K: (groupid=7, jobs=1): err= 0: pid=8681: Wed Jul 31 19:17:00 2024
  write: IOPS=539, BW=2159KiB/s (2211kB/s)(127MiB/60002msec); 0 zone resets
    slat (usec): min=8, max=341, avg=55.00, stdev=11.58
    clat (usec): min=1345, max=27205, avg=1784.91, stdev=628.23
     lat (usec): min=1357, max=27217, avg=1840.89, stdev=629.27
    clat percentiles (usec):
     |  1.00th=[ 1467],  5.00th=[ 1549], 10.00th=[ 1631], 20.00th=[ 1696],
     | 30.00th=[ 1713], 40.00th=[ 1745], 50.00th=[ 1745], 60.00th=[ 1762],
     | 70.00th=[ 1778], 80.00th=[ 1795], 90.00th=[ 1926], 95.00th=[ 1958],
     | 99.00th=[ 2040], 99.50th=[ 2245], 99.90th=[13829], 99.95th=[14222],
     | 99.99th=[15533]
   bw (  KiB/s): min= 1883, max= 2648, per=100.00%, avg=2162.46, stdev=122.72, samples=119
   iops        : min=  470, max=  662, avg=540.60, stdev=30.71, samples=119
  lat (msec)   : 2=98.35%, 4=1.40%, 20=0.24%, 50=0.01%
  cpu          : usr=1.51%, sys=4.23%, ctx=32409, majf=0, minf=10
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,32392,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=86.8MiB/s (91.0MB/s), 86.8MiB/s-86.8MiB/s (91.0MB/s-91.0MB/s), io=1024MiB (1074MB), run=11799-11799msec

Run status group 1 (all jobs):
  WRITE: bw=37.9MiB/s (39.7MB/s), 37.9MiB/s-37.9MiB/s (39.7MB/s-39.7MB/s), io=1024MiB (1074MB), run=27018-27018msec

Run status group 2 (all jobs):
   READ: bw=81.4MiB/s (85.4MB/s), 81.4MiB/s-81.4MiB/s (85.4MB/s-85.4MB/s), io=1024MiB (1074MB), run=12577-12577msec

Run status group 3 (all jobs):
  WRITE: bw=34.2MiB/s (35.9MB/s), 34.2MiB/s-34.2MiB/s (35.9MB/s-35.9MB/s), io=1024MiB (1074MB), run=29927-29927msec

Run status group 4 (all jobs):
   READ: bw=11.8MiB/s (12.4MB/s), 11.8MiB/s-11.8MiB/s (12.4MB/s-12.4MB/s), io=710MiB (745MB), run=60001-60001msec

Run status group 5 (all jobs):
  WRITE: bw=2203KiB/s (2256kB/s), 2203KiB/s-2203KiB/s (2256kB/s-2256kB/s), io=129MiB (135MB), run=60003-60003msec

Run status group 6 (all jobs):
   READ: bw=11.4MiB/s (12.0MB/s), 11.4MiB/s-11.4MiB/s (12.0MB/s-12.0MB/s), io=685MiB (718MB), run=60001-60001msec

Run status group 7 (all jobs):
  WRITE: bw=2159KiB/s (2211kB/s), 2159KiB/s-2159KiB/s (2211kB/s-2211kB/s), io=127MiB (133MB), run=60002-60002msec

Disk stats (read/write):
  sdb: ios=359415/67382, merge=3/0, ticks=210099/167643, in_queue=377743, util=99.56%